Config/InformationRegisters/ВерсииУстановленныхОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииУстановленныхОтчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОтчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/УстановленныеКомплектыОтчетности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеКомплектыОтчетности</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеИзмененийHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Comment>Если Истина, то по умолчанию не будет установлен флаг в загрузке комплекта и не будет оповещать о новой версии</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ВерсииУстановленныхОтчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗарегистрироватьВерсииОтчетов(ВидыОтчетов, Идентификатор, Версия)Экспорт
		
	Если Не ЗначениеЗаполнено(ВидыОтчетов) Тогда 
		Возврат;
	КонецЕсли;	
	
	НачатьТранзакцию();
	
	Попытка
		БлокировкаДанных = Новый БлокировкаДанных;
		БлокировкаДанных.Добавить("РегистрСведений.ВерсииУстановленныхОтчетов");
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписейЗарегистрированные = РегистрыСведений.ВерсииУстановленныхОтчетов.СоздатьНаборЗаписей();
		НаборЗаписейЗарегистрированные.Прочитать();
		
		ТаблицаЗаписей = НаборЗаписейЗарегистрированные.Выгрузить();
		
		ТаблицаВО = ТаблицаЗаписей.Скопировать(,"ВидОтчета");
		ТаблицаВО.Колонки.Добавить("Количество");
		ТаблицаВО.ЗаполнитьЗначения(1,"Количество");
		ТаблицаВО.Свернуть("ВидОтчета","Количество");
		
		ТаблицаЗаписей.Индексы.Добавить("ВидОтчета");
		
		Для Каждого ТекСтр Из ТаблицаВО Цикл
			Если ТекСтр.Количество =1 Тогда
				Продолжить;
			КонецЕсли;
			//дубли в регистре
			
			ЗаписиРегистра  = ТаблицаЗаписей.НайтиСтроки(Новый Структура("ВидОтчета", ТекСтр.ВидОтчета));
			Первая = Истина;
			Для Каждого СтрЗапись Из ЗаписиРегистра Цикл
				Если Первая Тогда
					//первую запись оставляем, остальные удаляем
					Первая = Ложь;
				Иначе
					ТаблицаЗаписей.Удалить(СтрЗапись); //удаляем дублирующие записи по виду отчета 
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого ВидОтчета Из ВидыОтчетов Цикл
			
			ЗаписиРегистра  = ТаблицаЗаписей.НайтиСтроки(Новый Структура("ВидОтчета", ВидОтчета));
			Для Каждого СтрЗапись Из ЗаписиРегистра Цикл
				
				ТаблицаЗаписей.Удалить(СтрЗапись); //удаляем все упоминания отчета 
				
			КонецЦикла;
			
			СтрЗапись                        = ТаблицаЗаписей.Добавить(); //и добавлем правильную запись
			СтрЗапись.ВидОтчета              = ВидОтчета;
			СтрЗапись.ИдентификаторКомплекта = Идентификатор;
			СтрЗапись.Версия                 = Версия;
			
		КонецЦикла;
		
		НаборЗаписейЗарегистрированные.Загрузить(ТаблицаЗаписей);
		НаборЗаписейЗарегистрированные.Записать();
		
		// Удаляем "осиротевшие" комплекты, для которых не осталось ни одного отчета
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	УстановленныеКомплектыОтчетности.ИдентификаторКомплекта
		|ИЗ
		|	РегистрСведений.УстановленныеКомплектыОтчетности КАК УстановленныеКомплектыОтчетности
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВерсииУстановленныхОтчетов КАК ВерсииУстановленныхОтчетов
		|		ПО УстановленныеКомплектыОтчетности.ИдентификаторКомплекта = ВерсииУстановленныхОтчетов.ИдентификаторКомплекта
		|ГДЕ
		|	ВерсииУстановленныхОтчетов.ВидОтчета ЕСТЬ NULL";
		
		Результат = Запрос.Выполнить();
		
		Блокировка        = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.УстановленныеКомплектыОтчетности");
		ЭлементБлокировки.ИсточникДанных = Результат;
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("ИдентификаторКомплекта","ИдентификаторКомплекта");
		Блокировка.Заблокировать();
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Запись = РегистрыСведений.УстановленныеКомплектыОтчетности.СоздатьМенеджерЗаписи();
			Запись.ИдентификаторКомплекта = Выборка.ИдентификаторКомплекта;
			Запись.Удалить();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры	

#КонецЕсли
